Revit 2026 API

# ExternalResourceServiceUtils Class

---

Contains utilities related to external resource service.

SystemObject Autodesk.Revit.DBExternalResourceServiceUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ExternalResourceServiceUtils
```
```vb
Public NotInheritable Class ExternalResourceServiceUtils
```
```cpp
public ref class ExternalResourceServiceUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalResourceServiceUtils = class end
```

The ExternalResourceServiceUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetServersByType | Gets registered external resource servers which support the external resource type. |

#### Reference

Autodesk.Revit.DB Namespace